Revit 2024 API
RoundingMethod Enumeration
 Rounding methods
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Since: 2016
Syntax
C#
public enum RoundingMethod
Visual Basic
Public Enumeration RoundingMethod
Visual C++
public enum class RoundingMethod
Members
Member name | Description
Nearest |  Standard rounding: Round to Nearest
Up |  Round Up
Down |  Round Down
See Also
Autodesk.Revit.DB Namespace